let phrases = [
  "..як напишеш, так уже і буде. Але не бійся прикрого рядка. Прозрінь не бійся, бо вони як ліки. (Ліна Костенко)",
  "Не бійся правди, хоч яка гірка, не бійся смутків, хоч вони як ріки. (Галина Завидовська)",
  "Живи душею чистою, простою, не вимагай багато від життя (Галина Завидовська)",
  "Так багато на світі горя, люди, будьте взаємно красивими! (Ліна Костенко)",
  "Нема в житті, щоб було щось завчасно, на все свій час - все буде добре!!! (Галина Завидовська)",
  "Живи! Життя як швидкий потяг, так швидко пролетить, як одна мить (Галина Завидовська)",
  "Просто потрібно бути терплячими і міцними. Все закінчилося. Ми лишилися в більшості. Просто цей світ не може вмістити такої кількості болю й тікої кількості ніжності (Сергій Жадан)", //Сергій Жадан
  "Ти вір, що світ цей зміниться на краще, що неодмінно в дім прийде наш щастя! (Галина Завидовська)",  
];
while (true) {
  let question = prompt("Задайте питання гадалці або напишіть ! для виходу"); // отримати питання
  if (question === "!") {
    alert("До наступного разу!");
    break;
  }
  let randomIndex = Math.floor(Math.random() * phrases.length);

  alert(phrases[randomIndex]);
}
