let words = [
  ["Вчора", "Ввечері", "Вранці", "Вночі"],
  ["в книгарні", "в підземному переході", "в парку", "в під'їзді"],
  ["перевдягнений", "сонний", "навчений", "насуплений"],
  ["слон", "прибулець", "клоун", "хлопчик"],
  ["з'явився.", "жонглював.", "спав.", "впав."],
  [
    "вийшла велика пригода.",
    "вийшов незрозумілий випадок.",
    "вийшло незвичайне видовище.",
    "вийшла кумедна ситуація.",
  ],
  ["Привіт!", "Як таке може бути?", "Як допомогти?", "Салют!"],
];
phrase = "";
for (let i = 0; i < words.length; i++) {
  if (i == 5) {
    phrase += `З цього ${
      words[i][Math.floor(Math.random() * words[i].length)]
    } `;
  } else if (i == 6) {
    phrase += `Люди сказали: "${
      words[i][Math.floor(Math.random() * words[i].length)]
    }"`;
  } else {
    phrase += words[i][Math.floor(Math.random() * words[i].length)] + " ";
  }
}
alert(phrase);
